{
    "articleId": "1",
    "imageSrc": "https://cdn.nba.com/manage/2021/01/wiseman-intro-iso-scaled-e1611769078115.jpg",
    "title": "Kia Rookie Ladder",
    "texts": [
        "Getting a great matchup between the top two players selected in any given Draft isn’t necessarily the stuff of legends, at least not since Mt. Rushmore types Oscar Robertson and Jerry West went 1-2 way back in 1960. But it does make for a little contemporary intrigue, based on the scouting reports and debates that might have hung over the most recent Draft.",
        "And this week, in a scheduling quirk based on virus concessions, we get it twice with the Minnesota Timberwolves playing the Golden State Warriors in consecutive games at San Francisco’s Chase Center.",
        "Anthony Edwards, whom the Wolves picked No. 1 overall in November, went head-to-head if not position-to-position Monday with Warriors center James Wiseman, the No. 2 pick. They’ll do it again Wednesday (10 p.m. ET, ESPN) to determine … well, nothing official or momentous. But it will provide another glimpse of the guys judged a couple of months ago — in a Class of 2020 with an unclear pecking order — to have the most talent, the most potential or some combination thereof.",
        "Wiseman won Round 1. Golden State beat Minnesota 130-108 and the 7-foot big man had the better stats line: 13 points on 4-for-5 shooting with four rebounds and two blocks. Edwards scored 15 points but did so on 4-for-13 shooting, with three boards, one assist and a steal. Wiseman was a minus-2 in 16 minutes while the 6-foot-4 wing from Georgia was minus-10 in 27.",
        "One wrinkle Monday was that Wiseman came off the bench, doing for the first time this season what Edwards has done every game for Minnesota. Warriors coach Steve Kerr wanted to change his rotation in hopes of getting more robust starts. So Kevon Looney swapped spots with Wiseman for what could be a short- or long-term tweak.",
        "Kerr said Wiseman took the news like a pro and then he played like it. Edwards has handled his reserve role smoothly too. But with Minnesota sputtering at 4-12 with Karl-Anthony Towns sidelined by health and safety protocols following a positive virus test, and D’Angelo Russell missing time with a sore quad muscle, some in the team’s fan base have pushed for longer minutes for the prize rookie."
    ],
    "date": "8 hours ago"
}